# Pandas

In [55]:
import numpy as np
import pandas as pd

## 2. Dataframe

### 1) 생성

In [56]:
data = {
    '국어': [80, 90, 70, 30],
    '영어': [90, 70, 60, 40],
    '수학': [90, 60, 80, 70]
}
index = ['춘향','몽룡','향단','방자']
df = pd.DataFrame(data, index=index)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [57]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(40,101,12).reshape(4,3),columns=['국어','영어','수학'], index=index)
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [58]:
# 반복문으로 데이터를 만드는 경우 딕셔너리의 리스트로 생성할 수 있음
l = []
for i in range(4):
    d = {'국어':np.random.randint(40,101),'영어':np.random.randint(40,101),'수학':np.random.randint(40,101)}
    l.append(d)
l

[{'국어': 64, '영어': 52, '수학': 94},
 {'국어': 46, '영어': 78, '수학': 46},
 {'국어': 73, '영어': 77, '수학': 47},
 {'국어': 41, '영어': 86, '수학': 73}]

In [59]:
df3 = pd.DataFrame(l, index=index)
df3

    국어  영어  수학
춘향  64  52  94
몽룡  46  78  46
향단  73  77  47
방자  41  86  73

### 2) 인덱싱

In [60]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [61]:
# 데이터 프레임은 열을 먼저.
df['국어']

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [62]:
df.국어

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

- 열 인덱스, 행 인덱스

In [63]:
df['국어']['춘향'], df['국어'][0], df.국어[0], df.국어.춘향 # numpy처럼 열과 행을 콤마(,)로 구분해서 쓸 수는 없음

(80, 80, 80, 80)

- 슬라이스

In [64]:
df['국어'][:2]

춘향    80
몽룡    90
Name: 국어, dtype: int64

In [65]:
# 열에 대해서는 ['국어':'영어']와 같이 슬라이스를 할 수 없음. 리스트 형태로 써야 함.
df[['국어','영어']][:2]

    국어  영어
춘향  80  90
몽룡  90  70

In [66]:
df[['국어','영어']][:'향단'] # 행 인덱스를 숫자로 쓸 때는 해당 숫자 앞까지. 인덱스명으로 쓰면 해당 인덱스 포함.

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60

In [67]:
df[['국어']][:'향단'] # 열에 리스트가 들어가 있으면 데이터프레임.

    국어
춘향  80
몽룡  90
향단  70

In [68]:
df['국어'][:'향단'] # 위와 다르게 시리즈

춘향    80
몽룡    90
향단    70
Name: 국어, dtype: int64

- loc 인덱서: [행인덱스, 열인덱스]

In [69]:
df.loc['몽룡','국어']

90

In [70]:
df.loc['몽룡'][0], df.loc['몽룡']['국어']

(90, 90)

In [71]:
# df9 = pd.DataFrame(np.random.randint(60,101,20).reshape(4,5),columns=list('ABCDE'), index=list('wxyz'))
# df9

- iloc 인덱서:[행숫자, 열숫자]

In [72]:
df.iloc[1,0]

90

- 값 변경 및 열 추가

In [73]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [74]:
df['국어']['방자'] = 75
df['영어']['방자'] = 82
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

In [75]:
df['과학'] = 30
df

    국어  영어  수학  과학
춘향  80  90  90  30
몽룡  90  70  60  30
향단  70  60  80  30
방자  75  82  70  30

In [76]:
df['과학'] = [30,40,50,60] # df.과학 = [30,40,50,60] 은 안됨
df

    국어  영어  수학  과학
춘향  80  90  90  30
몽룡  90  70  60  40
향단  70  60  80  50
방자  75  82  70  60

# 열 삭제

In [77]:
del df['과학']
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

In [78]:
# del df.loc['방자'] # Error case1
# df

In [79]:
df.drop(['방자'])

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80

In [80]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

In [81]:
df.drop(['방자'], inplace=True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80